app/controllers/class_schedules_controller.rb

INSERT INTO `class_schedules` (`cancelled`, `created_at`, `end_time`, `location`, `module_code`, `start_time`, `subjects_id`, `updated_at`) VALUES (0, '2015-02-17 13:38:02', '2015-02-18 13:37:00', 'G21', 'CS1101', '2015-02-17 13:37:00', 0, '2015-02-17 13:38:02')
---
  def create
    module_code = params[:class_schedule][:module_code]
    title = params[:class_schedule][:title]
    location = params[:class_schedule][:location]
    num_weeks = params[:class_schedule][:repeats].to_i
    start_date = params[:class_schedule][:date]
    start_time = params[:class_schedule][:time_s]
    end_time = params[:class_schedule][:time_e]

    @class_schedule = ClassSchedule.new(module_code: module_code, title: title, start_time: "#{start_date} #{start_time}".to_datetime,
                                        end_time: "#{start_date} #{end_time}".to_datetime, location: location)

    @class_schedule.save

SELECT  `class_schedules`.* FROM `class_schedules`  WHERE `class_schedules`.`id` = 1 LIMIT 1
---
    def set_class_schedule
      @class_schedule = ClassSchedule.find(params[:id])