app/controllers/events_controller.rb

SELECT `events`.* FROM `events`  WHERE `events`.`user_id` IS NULL
---
  def index
      @events = Event.where(user_id: session[:user_id])

INSERT INTO `events` (`created_at`, `description`, `finish`, `name`, `start`, `updated_at`, `user_id`) VALUES ('2015-02-17 14:24:49', 'Test', '2015-02-18 15:24:00', 'Another Event', '2015-02-18 14:24:00', '2015-02-17 14:24:49', 112456672)
---
  def create
    #@event = Event.create(event_params)
    @event = Event.new(event_params)
    @event.user_id = session[:user_id]
    @event.save

UPDATE `events` SET `finish` = '2015-02-26 17:29:00', `start` = '2015-02-26 16:29:00', `updated_at` = '2015-02-17 12:54:53' WHERE `events`.`id` = 3
---
  def update
    @event.update_attributes(event_params)

SELECT  `events`.* FROM `events`  WHERE `events`.`id` = 3 LIMIT 1
---
    def set_event
      @event = Event.find(params[:id])