app/controllers/meetings_controller.rb

  def index
    @meetings = Meeting.all
---
SELECT `meetings`.* FROM `meetings`

  def create
    if(params[:meeting][:algorithm])
      #results = ["a", "b", "c"]
      session[:results] = find_free_slots(params[:meeting][:users], params[:meeting][:day])
      scheduler

      flash[:danger] = "WHOO"
    else
      @meeting = Meeting.new(params[:meeting])
      respond_to do |format|
        if @meeting.save
---
INSERT INTO `meetings` (`confirmed_by_all`, `created_at`, `description`, `end_time`, `location`, `start_time`, `updated_at`) VALUES (0, '2015-02-23 12:55:05', '', '2015-02-23 12:54:00', '', '2015-02-23 12:54:00', '2015-02-23 12:55:05')

  def destroy
    @meeting.destroy
---
DELETE FROM `meetings` WHERE `meetings`.`id` = 1

  def set_meeting
    @meeting = Meeting.find(params[:id])
---
SELECT  `meetings`.* FROM `meetings`  WHERE `meetings`.`id` = 1 LIMIT 1