app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.all
---
SELECT `subjects`.* FROM `subjects`