app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    @users = User.all

INSERT INTO `users` (`created_at`, `email`, `first_name`, `id`, `last_name`, `password_digest`, `phone_num`, `updated_at`, `user_type_id`) VALUES ('2015-02-18 12:42:23', '112456672@umail.ucc.ie', 'Will', 112456672, 'Murphy', '$2a$10$dlhL5RaDiFx6TXl4aTZ/Leanpkv9FnPmE4C30ewEzlbqvMnXdiVJq', '0864093776', '2015-02-18 12:42:23', 1)
---
  def create
    #Create the user from the form submission
    if admin?
      params[:user][:user_type_id] = 2;
    else
      params[:user][:user_type_id] = 1;
    end

    @user = User.new(id: params[:user][:id], user_type_id: params[:user][:user_type_id], first_name: params[:user][:first_name],last_name: params[:user][:last_name],
                          email: "#{params[:user][:id]}@umail.ucc.ie", phone_num: params[:user][:phone_num],
                          password: params[:user][:password], password_confirmation: params[:user][:password_confirmation], public_profile: false)

    #Assign the user an email depending on whether they are student or staff
    if params[:user][:user_type_id] == 2
      @user.email = params[:user][:email]
    end

    if params[:user][:user_type_id] == 2
      @user.public_profile = true
    end

    respond_to do |format|
      if check_for_existing_user(@user)
        if @user.save

DELETE FROM `users` WHERE `users`.`id` = 111385351
---
  def destroy
    @user.destroy

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 123456789 LIMIT 1
---
    def set_user
      @user = User.find(params[:id])